window.OR = window.OR || {};
OR.suppliers = [
  { id:'eastwest', name:'מזרח מערב', phone:'+972504320036', emails:[], branches:['הילס','נורדאו'] },
  { id:'diplomat', name:'דיפלומט', phone:'+972545650080', emails:[], branches:['הילס','נורדאו'] },
  { id:'seafood', name:'מדג סי פרוט', phone:'+972544335959', emails:[], branches:['הילס','נורדאו'] },
  { id:'creamcheese', name:"קרים צ'יז", phone:'+972546766364', emails:[], branches:['הילס'] },
  { id:'handels', name:'הנדלס', phone:'+972526010182', emails:[], branches:['הילס','נורדאו'] },
  { id:'mrcake', name:'מר קייק', phone:'+972544748466', emails:[], branches:['הילס'] },
  { id:'dish', name:'מדיח חגי', phone:'+97239071742', emails:[], branches:['הילס','נורדאו'] },
  { id:'dimsum', name:'דים סאם', phone:'+972585533322', emails:[], branches:['הילס','נורדאו'] },
  { id:'deep', name:'דיפ שיווק', phone:'+972508873018', emails:[], branches:['הילס','נורדאו'] },
  { id:'hadp', name:'חדפ', phone:'+972543450109', emails:[], branches:['הילס','נורדאו'] },
];

OR.items = {
  'seafood': ['צלופח','שרימפס וונמי','טוביקו ירוק','טוביקו שחור','איקורא','קאט פיש'],
  'diplomat': ['אורז סושי בוטאן','אטריות שעועית','מיונז היינץ SOM','טופו קשה כחול','דיספנסר אדום','דיספנסר ירוק דל מלח','קטשופ לחיצה היינץ','סקיפי גדול','צילי מתוק הלתי בוי','צילי חריף הלתי בוי','שיטאקי','מחית פלפל קוראני','סויה גדול 15.1','סויה מנות TA','סויה מנות ירוק  TA','מחית כמהין קטן'],
  'eastwest': ['אבקת וואסבי','א. ביצים לאיון','אטריות אורז 3 מ"מ','ג׳ינג׳ר לבן'],
  'creamcheese': ["קרים צ'יז","בלוק חמאה צהובה","פרמזן גוש"],
  'handels': ['מעדן אווז'],
  'mrcake': ['מחית וניל','שוקולד לבן','מחית פטל קפוא','סוכר אינוורטי','נייר אפייה','קסנטן','אבץ','פקטין NH'],
  'dish': ['מבריק','סבון'],
  'dimsum': ['באן כפפה'],
  'deep': ['אבקת בצל','אבקת שום','פפריקה מתוקה','אבקת סוכר','קשיו מסוכר','בוטן מטוגן שיקרצקי','סילאן גאלון','חרדל חלק דלי'],
  'hadp': ['כובע טבח מנייר','מגבון לח אישי קראפט']
};

OR.supplyDays = ['א','ב','ג','ד','ה','ו','ש'];
